CSI API ETABS v1
cDCompColCSAS16_19 Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDCompColCSAS16_19
Public Interface cDCompColCSAS16_19
Dim instance As cDCompColCSAS16_19
public interface class cDCompColCSAS16_19
type cDCompColCSAS16_19 =  interface end
The cDCompColCSAS16_19 type exposes the following members.
Methods
Name | Description
GetOverwrite
 Retrieves the value of a composite column design overwrite item.
GetPreference
 Retrieves the value of a composite column design preference item.
SetOverwrite
 Sets the value of a composite column design overwrite item.
SetPreference
 Sets the value of a composite column design preference item.
Top
See Also
Reference
ETABSv1 Namespace